
&НаКлиенте
Процедура ОткрытьОтчетСПараметрами(Команда)
	ПараметрыОтчета = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Поле1", 1);
	
	ПараметрыОтчета.Вставить("Отбор", Отбор);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", ПолучитьПользовательскиеНастройки());
	//ПараметрыОтчета.Вставить("ФиксированныеНастройки", ПолучитьФиксированныеНастройки());
	
	ОткрытьФорму("Отчет.СКД_ОткрытьОтчетИПередатьПараметры.Форма.ФормаОтчета", ПараметрыОтчета);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПользовательскиеНастройки()
	
	КомпоновщикНастроекОтчета = Отчеты.СКД_ОткрытьОтчетИПередатьПараметры.Создать().КомпоновщикНастроек; 
	Настройки = КомпоновщикНастроекОтчета.Настройки;
	
	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Параметр1")); 
	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда // чтобы это условие выполнилось, нужно, чтобы у параметра стояла галка Включать в пользовательские поля
		ПользовательскийПараметр = КомпоновщикНастроекОтчета.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
			ПользовательскийПараметр.Значение = "что-то"; 
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат КомпоновщикНастроекОтчета.ПользовательскиеНастройки;
	
КонецФункции

&НаСервере
Функция ПолучитьФиксированныеНастройки()
	
	КомпоновщикНастроекОтчета = Отчеты.СКД_ОткрытьОтчетИПередатьПараметры.Создать().КомпоновщикНастроек; 
	Настройки = КомпоновщикНастроекОтчета.Настройки;
	
	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Параметр2")); 
	ЭлементНастройки.Значение = "что-то"; 
	
	Возврат КомпоновщикНастроекОтчета.ФиксированныеНастройки;
	
КонецФункции
