
#Область _ // Выбор каталога

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранныйПуть = ПолучитьПутьККаталогу();
	Если ВыбранныйПуть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя] = ВыбранныйПуть;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПутьККаталогу()
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогФыбораФайла.Заголовок = "Выберите каталог";
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Возврат ДиалогФыбораФайла.Каталог;
	КонецЕсли;	
	
КонецФункции


#КонецОбласти           

#Область _ // Выбор файла открытия

&НаКлиенте
Процедура ОткрываемыйФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранныйПуть = ПолучитьПутьКОткрываемомуФайлу("xml");
	Если ВыбранныйПуть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Элемент.Имя] = ВыбранныйПуть;
КонецПроцедуры


&НаКлиенте
Функция ПолучитьПутьКОткрываемомуФайлу(Маска = Неопределено)
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	Если ТипЗнч(Маска) = Тип("Строка") Тогда
		ДиалогФыбораФайла.Фильтр = "Файлы (*."+Маска+")|*."+ Маска; 
	КонецЕсли;
		
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Возврат ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;	
	
КонецФункции


#КонецОбласти           
