
// Процедура сканирует изображение используя установленный в системе сканер по умолчанию
// на выходе файл сохраняется на жестком диске
//
// Параметры
// ИмяФайла - Строка - Путь до файла изображения в формате PNG
// Реквизит - Строка - Поле картинки на форме
// 
// Пример
// ОтсканироватьИСохранить("C:\image.png");
Процедура ОтсканироватьИОтобразить(ИмяФайла) Экспорт
	
	//http://msdn.microsoft.com/en-us/library/ms630491(v=VS.85).aspx
	//http://www.forum.mista.ru/topic.php?id=232458
	Изобр = Новый COMОбъект("WIA.ImageFile");
	СканДиалог = Новый COMОбъект("WIA.CommonDialog");
	Изобр = СканДиалог.ShowAcquireImage();
	
	Фильтр = Новый COMОбъект("WIA.ImageProcess");
	Фильтр.Filters.Add(Фильтр.FilterInfos("Convert").FilterID);
	ФильтрПНГ = Фильтр.Filters(1);
	Для Инд = 1 По ФильтрПНГ.Properties.Count Цикл
		Если ФильтрПНГ.Properties(Инд).Name = "FormatID" Тогда
			ФильтрПНГ.Properties(Инд).Value = "{B96B3CAF-0728-11D3-9D7B-0000F81EF32E}";
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Изобр = Фильтр.Apply(Изобр);
	
	УдалитьФайлы(ИмяФайла);
	Изобр.SaveFile(ИмяФайла);
	
КонецПроцедуры
