// взято с форума: http://forum.infostart.ru/forum26/topic87991/message1617540/#message1617540


//Для тех, кому нужно убрать в шахматке заголовок ресурса (в шапке), порядок действий следующий: 
//1) В выбранных полях всего отчета оставляем только ресурс 
//2) В выбранных полях группировки колонок убираем автополе, добавляем поле этой колонки (например, если группировка колонок по периоду, выбираем тут период) 
//3) И изюминка шаманского бубна - в "других настройках" корня отчета выбираем "расположение ресурсов" - "вертикально" 

//И никаких макетов не требуется. 

//Возможно, написал что-то банальное, или работает только в каком-то частном случае, но лично я 2 дня ломал мозг, в инете ничего не нашел - все пишут, что без макета группировки никак.