
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Макет1");
	
	
	ТабличныйДокументИсточник = Макет.ПолучитьОбласть(1,,15,);
	ТабличныйДокументПриемник = Макет.ПолучитьОбласть(1,,15,);
	НачальнаяЯчейкаПриемника = ТабличныйДокументПриемник.Область(7, 5);
	
	ТабличныйДокумент = ПрограммнаяРаботаСТабличнымиДокументами.РазместитьТабличныйДокументВТабличномДокументе(
													ТабличныйДокументПриемник,
													ТабличныйДокументИсточник,
													НачальнаяЯчейкаПриемника);
			
КонецПроцедуры
		

