
Функция СекундыВЧасыМинутыСекунды(Время)
	
	Секунды = Время % 60;
	Минуты = (Время-Секунды)/60;
	Минуты = Минуты % 60;
	Часы = (Время-Секунды-Минуты*60)/3600; 
	
	Возврат ""
			+ Часы + " ч "
			+ Минуты + " м "
			+ Секунды + " м ";
	
КонецФункции
		
Функция СекундыВЧасыМинутыСекунды_2(Время)
	
	СекундыДатой = Дата(1,1,1) + Время;
	
	Если Время < 60*60*24 Тогда
		КоличествоДнейСтрокой = "";
	Иначе
		КоличествоДнейСтрокой = Формат(Время / 60*60*24, "ЧДЦ=") + "д ";
	КонецЕсли;
	
	Возврат КоличествоДнейСтрокой + Формат(СекундыДатой, "ДЛФ=T");
	
КонецФункции
