
Функция СекундыВЧасыМинутыСекунды(Время)
	
	Секунды = Время % 60;
	Минуты = (Время-Секунды)/60;
	Минуты = Минуты % 60;
	Часы = (Время-Секунды-Минуты*60)/3600; 
	
	Возврат ""
			+ Часы + " ч "
			+ Минуты + " м "
			+ Секунды + " м ";
	
КонецФункции
		
Функция СекундыВЧасыМинутыСекунды_2(Время)
	
	СекундыДатой = Дата(1,1,1) + Время;
	
	Если Время < 60*60*24 Тогда
		КоличествоДнейСтрокой = "";
	Иначе
		КоличествоДнейСтрокой = Формат(Время / 60*60*24, "ЧДЦ=") + "д ";
	КонецЕсли;
	
	Возврат КоличествоДнейСтрокой + Формат(СекундыДатой, "ДЛФ=T");
	
КонецФункции

&НаСервере
Процедура Пауза(Значение) Экспорт

    ИмяФайла = ПолучитьИмяВременногоФайла("js");

    ТекстовыйДокумент = Новый ТекстовыйДокумент;
    ТекстовыйДокумент.УстановитьТекст("WScript.Sleep(WScript.Arguments(0))");
    ТекстовыйДокумент.Записать(ИмяФайла, КодировкаТекста.ANSI);

    WshShell = Новый COMОбъект("WScript.Shell");
    WshShell.Run("wscript.exe """ + ИмяФайла + """ " + Формат(Значение, "ЧГ=0"), 0, -1);

    Попытка
        УдалитьФайлы(ИмяФайла);
    Исключение
    КонецПопытки;

КонецПроцедуры

Функция ДатаСтрокойВЗапросе()
	ЧислоСтрокой = "00";
	Для сч = 0 По 99 Цикл
        ЧислоСтрокой = ЧислоСтрокой + Формат(сч,"ЧЦ=2; ЧВН=");
	КонецЦикла;
	
	ТекстЗапроса = 
	" ВЫБРАТЬ
	|	""20"" 
	|	+ ПОДСТРОКА(&ЧислоСтрокой, (ГОД(&Дата)	- 2000) * 2 + 1, 2) 
	|	+ ПОДСТРОКА(&ЧислоСтрокой, МЕСЯЦ(&Дата) 		* 2 + 1, 2) 
	|	+ ПОДСТРОКА(&ЧислоСтрокой, ДЕНЬ(&Дата) 			* 2 + 1, 2) 
	|	+ ПОДСТРОКА(&ЧислоСтрокой, ЧАС(&Дата) 			* 2 + 1, 2) 
	|	+ ПОДСТРОКА(&ЧислоСтрокой, МИНУТА(&Дата) 		* 2 + 1, 2) 
	|	+ ПОДСТРОКА(&ЧислоСтрокой, СЕКУНДА(&Дата)	 	* 2 + 1, 2) 
	|	";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЧислоСтрокой", """"+ЧислоСтрокой+"""");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "");
	
	Возврат ТекстЗапроса;
КонецФункции
