
Процедура СохранитьСвойствоОбъекта(Контрагент,ИмяСвойства,ЗначениеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвойстваОбъектов.Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	               |ГДЕ
	               |	СвойстваОбъектов.Наименование = &ИмяСвойства
	               |	И СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства";
	Запрос.УстановитьПараметр("ИмяСвойства",ИмяСвойства);
	Запрос.УстановитьПараметр("НазначениеСвойства",ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		СвойствоОбъект = ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
		СвойствоОбъект.НазначениеСвойства = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты;
		СвойствоОбъект.Наименование = ИмяСвойства;
		СвойствоОбъект.ТипЗначения  = Тип("Строка");
		СвойствоОбъект.Записать();		
		Свойство = СвойствоОбъект.Ссылка;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Свойство = Выборка.Ссылка;
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Контрагент);
	НаборЗаписей.Отбор.Свойство.Установить(Свойство);
	НС = НаборЗаписей.Добавить();
	НС.Объект = Контрагент;
	НС.Свойство = Свойство;
	НС.Значение = ЗначениеСвойства;
	
	НаборЗаписей.Записать();
	
	
КонецПроцедуры


Функция ПолучитьЗначениеДополнительногоСвойстваПоЗаголовку(Объект, ЗаголовокСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Значения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК Значения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК Свойства
	|		ПО (Свойства.Ссылка = Значения.Свойство)
	|			И (Свойства.Заголовок = &ЗаголовокСвойства)
	|ГДЕ
	|	Значения.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ЗаголовокСвойства", ЗаголовокСвойства);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
КонецФункции

