
Процедура ПисьмоВТехПоддержку( Знач пОбъект = Неопределено ) Экспорт
	// Источник: http://infostart.ru/public/506913/ (в комментариях)
    
    адресТехПоддержки = "v8@1c.ru";
    адресРегламента = "http://";
    
    контекст = "База 1С: %1
    |Объект: %2
    |Пользователь: %3
    |Имя компьютера: %4";
    
    имяБазы = СтрокаСоединенияИнформационнойБазы();
    
	контекст = СтрЗаменить(контекст, "%1", имяБазы);
	контекст = СтрЗаменить(контекст, "%2", пОбъект);
	контекст = СтрЗаменить(контекст, "%3", ИмяПользователя());
	контекст = СтрЗаменить(контекст, "%4", ИмяКомпьютера());
    
    текстСсылка = "mailto:" + адресТехПоддержки + "?body=<Опишите проблему в развернутом виде, приложите скриншот>
    |
    |Регламент обращения в службу тех. поддержки: " + адресРегламента + "
    |
    |--- Системная информация ---
    |
    |" + контекст;
    
    текстСсылка = СтрЗаменить( текстСсылка, Символы.ПС, "%0A");
    
    ЗапуститьПриложение( текстСсылка );
    
КонецПроцедуры