
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ЭлементТабличнаяЧасть = Элементы.Товары;
	ЭлементТекущаяКолонка = ЭлементТабличнаяЧасть.ТекущийЭлемент.Имя;
	ИмяРеквизита = Сред(ЭлементТекущаяКолонка, СтрДлина(ЭлементТабличнаяЧасть.Имя) + 1);
	ОбработатьСтрокуТЧ(ИмяРеквизита);
КонецПроцедуры

Процедура ОбработатьСтрокуТЧ(ИмяИзменяемогоРеквизита)
	МассивИзмененныхРеквизитов = Новый Массив;
	МассивИзмененныхРеквизитов.Добавить(ИмяИзменяемогоРеквизита);
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// обратные зависимости
	Если МассивИзмененныхРеквизитов.Найти("Сумма") <> Неопределено Тогда
		Если ТекущаяСтрока.Количество Тогда
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
		Иначе
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма; 
		КонецЕсли;
	КонецЕсли;
	
	// прямые зависимости
	Если МассивИзмененныхРеквизитов.Найти("Цена") <> Неопределено
		ИЛИ МассивИзмененныхРеквизитов.Найти("Количество") <> Неопределено
		Тогда
		
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
		
		МассивИзмененныхРеквизитов.Добавить("Сумма");
	КонецЕсли;
	
	Если МассивИзмененныхРеквизитов.Найти("Сумма") <> Неопределено Тогда
		ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма * 1.18;
	КонецЕсли;
	
	
КонецПроцедуры
