&НаКлиенте
Процедура ОткрытьФормуСПараметрами(Команда)
	
	ИмяОткрываемойФормы = "ФормаОткрываемая";
	ПараметрыОткрываемойФормы = Новый Структура();
	
	// Вариант 1
	// Другая форма текущей обработки (при этом текущая обработка может быть внешней или внутренней)
	ПолноеИмяФормы = ПолучитьПолноеИмяФормы(ИмяОткрываемойФормы);
	
	// Вариант 2
	//// Конкретная форма внешней обработки с использованием пути файла
	//Путь = ИспользуемоеИмяФайла();
	//ИмяОбработки = ПодключитьВнешнююОбработкуНаКлиенте(Путь);
	//ПолноеИмяФормы = "ВнешняяОбработка."+ ИмяОбработки +".Форма."+ИмяОткрываемойФормы;	
	
	ОткрытаяФорма = ОткрытьФорму(ПолноеИмяФормы, ПараметрыОткрываемойФормы);
	
	//ОткрытьФормуСПараметрамиНаСервере();
КонецПроцедуры

&НаСервере 
Функция ПолучитьПолноеИмяФормы(ИмяФормы)

    СимволТочка = ".";
    ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
    Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл ПозицияТочки = ПозицияТочки - 1; КонецЦикла; //
    Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;

КонецФункции

&НаСервере 
Функция ИспользуемоеИмяФайла()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ИспользуемоеИмяФайла;
КонецФункции


&НаКлиенте
Функция ПодключитьВнешнююОбработкуНаКлиенте(ПутьКФайлуНаКлиенте)
    АдресХранилища = "";
	ПоместитьФайл(АдресХранилища, ПутьКФайлуНаКлиенте, , Ложь);
	ИмяОбработки = ПодключитьВнешнююОбработкуНаСервере(АдресХранилища);
	Возврат ИмяОбработки;
КонецФункции

&НаСервере
Функция ПодключитьВнешнююОбработкуНаСервере(АдресХранилища)
	Возврат ВнешниеОбработки.Подключить(АдресХранилища,,Ложь);
КонецФункции

