
// 1. Передача с клиента на сервер
&НаКлиенте
Процедура КомандаПередатьНаСервер(Команда)
	
	ПутьКФайлу = "C:\temp.txt";
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере(АдресХранилища)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ДвоичныеДанные.Записать(ВременныйФайл);
	
КонецПроцедуры

// 2. Передача с сервера на клиент
&НаКлиенте
Процедура КомандаПередатьНаКлиент(Команда)
	АдресХранилища = ПолучитьАдресФайлаВХранилищеССервера();
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ДвоичныеДанные.Записать(ВременныйФайл);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресФайлаВХранилищеССервера()
	
	ПутьКФайлу = "C:\temp.txt";
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции


