
Функция ПолучитьВыгруженныеДанные() Экспорт
	Результат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса_Справочник_Справочник1();
	
	
	ТаблицаИзЗапроса = Запрос.Выполнить().Выгрузить();
	Результат.Вывести(ПолучитьТабличныйДокументПоТаблицеЗначений(ТаблицаИзЗапроса, "Тест"));
	
	Возврат Результат;
КонецФункции

Функция ТекстЗапроса_Справочник_Справочник1()
	Возврат
	"ВЫБРАТЬ
	|	ш.Ссылка,
	|	ш.Код,
	|	ш.Наименование
	|ИЗ
	|	Справочник.Справочник1 КАК ш";
КонецФункции

Функция ПолучитьТабличныйДокументПоТаблицеЗначений(ТаблицаЗначений, ТипДанных)
	
	Выгрузчик = Обработки.xddDataDumper_new.Создать();
	Возврат Выгрузчик.ВыгрузитьТаблицуЗначенийВТабличныйДокумент(ТаблицаЗначений, ТипДанных);
	
КонецФункции

Процедура ЗагрузитьДанные(ТабличныйДокумент) Экспорт
	
	
	
КонецПроцедуры