
Процедура ВывестиСКДВТабличныйДокумент(МакетСКД, ТабличныйДокумент, КомпоновщикНастроек = Неопределено) 
	
	Если КомпоновщикНастроек = Неопределено Тогда
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.ЗагрузитьНастройки(МакетСКД.НастройкиПоУмолчанию);		
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();  
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетСКД, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
// Пример вызова из отчета	
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь; 
//	ПрограммнаяРаботаССКД.ВывестиСКДВТабличныйДокумент(СхемаКомпоновкиДанных, ДокументРезультат, КомпоновщикНастроек);
//	
//КонецПроцедуры	
	
КонецПроцедуры

Функция ПолучитьТаблицуЗначенийИзСКД(МакетСКД, КомпоновщикНастроек) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();  
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетСКД, Настройки,,,
				Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат;
	
КонецФункции


Процедура УстановитьЗначениеПараметра(ОтчетОбъект, ИмяПараметра, Значение) Экспорт
    
    ПараметрыОтчета = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
    
    Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
    Параметр.Использование = Истина;
    Параметр.Значение = Значение;
    
КонецПроцедуры

Функция ПолучитьЗначениеПараметра(ОтчетОбъект, ИмяПараметра) Экспорт
    
    ПараметрыОтчета = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
    
    Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
    Возврат Параметр.Значение;
    
КонецФункции


Процедура УстановитьЗначениеПараметраПользовательскихНастроек(ПользовательскиеНастройки, ИмяПараметра, ЗначениеПараметра) Экспорт
	
	Для Каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл
		Если НЕ ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ""+Элемент.Параметр = ИмяПараметра Тогда
			Продолжить;
		КонецЕсли;
		Элемент.Значение = ЗначениеПараметра;
		Элемент.Использование = Истина;
		
		Возврат;
		
	КонецЦикла;
	
	// пример вызова:
	// ПользовательскиеНастройки = ПолучитьПользовательскиеНастройкиОтчетаНаСервере("ГПН_СправкаОНаличииНПДляСобственника");
	// УстановитьЗначениеПараметраПользовательскиНастройки(ПользовательскиеНастройки, "Период", Дата(2016,1,1));
	
КонецПроцедуры

Процедура ДобавитьПараметрПользовательскихНастроек(СхемаКомпоновкиДанных, ИмяПараметра) Экспорт
	
	ПараметрКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыДанных.Элементы.Добавить();
    ПараметрКомпоновки.Параметр = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
    ПараметрКомпоновки.Использование = Истина;
	
	ПараметрСхемы = СхемаКомпоновкиДанных.Параметры.Добавить();
	ПараметрСхемы.Имя = ИмяПараметра;
	
КонецПроцедуры

Функция ПолучитьПользовательскиеНастройкиОтчетаНаСервере(ИмяОтчета) Экспорт
	ОтчетОбъект = Отчеты[ИмяОтчета].Создать();
	Возврат ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки;
КонецФункции

// {{****************************************************************************
//    ШАБЛОНЫ ДЛЯ ИСПОЛЬЗОВАНИЯ СКД - http://infostart.ru/public/80164/
// 
//****************************************************************************
// Заполняет переданный объект на основании СКД
//
// Параметры
//
//  схемаСКД – схема СКД
//
//  ОбъектДляЗагрузки – объект в который выгружаются данные, таблица значений, дерево значений, табличный документ
//
//  ИсполняемыеНастройки – Пользовательские настройки СКД, если не указаны, будут использованы настройки СКД по умолчанию
//
//  СтруктураПараметров - Структура – Передаваемые для СКД параметры
//
//	В итоге получение данных сводится к трем простым действиям:
//		1. Написать запрос и настроить СКД  
//	в любой консоли, позволяющей это сделать.
//		2. Выгрузить настройки из консоли и загрузить в макет
//		3. Написать в необходимом месте код типа:
//
//		ДеревоЗначений = Новый ДеревоЗначений;
//		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
//		СтруктураПараметров = Новый Структура("ДатаОтчета", НашаДата);
//		ПолучитьДанныеНаОснованииСКД(СхемаКомпоновкиДанных, ДеревоЗначений, СхемаКомпоновкиДанных.НастройкиПоУмолчанию, СтруктураПараметров);
//
Процедура ПолучитьДанныеНаОснованииСКД(схемаСКД, ОбъектДляЗагрузки, ИсполняемыеНастройки = Неопределено, СтруктураПараметров = Неопределено, РасшифровкаСКД = Неопределено, МакетКомпоновки = Неопределено, ВнешниеНаборыДанных = Неопределено) Экспорт

    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

    Если ТипЗнч(ОбъектДляЗагрузки) = Тип("ПолеТабличногоДокумента") ИЛИ ТипЗнч(ОбъектДляЗагрузки) = Тип("ТабличныйДокумент") Тогда
        ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанных");
    Иначе
        ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
    КонецЕсли;

    Если ИсполняемыеНастройки = Неопределено Тогда

        ИсполняемыеНастройки = схемаСКД.НастройкиПоУмолчанию;

    КонецЕсли;

    Если СтруктураПараметров <> Неопределено Тогда

        КоллекцияЗначенийПараметров = ИсполняемыеНастройки.ПараметрыДанных.Элементы;

        Для каждого Параметр Из СтруктураПараметров Цикл

            НайденноеЗначениеПараметра = КоллекцияЗначенийПараметров.Найти(Параметр.Ключ);

            Если НайденноеЗначениеПараметра <> Неопределено Тогда

                НайденноеЗначениеПараметра.Использование = Истина;

                НайденноеЗначениеПараметра.Значение = Параметр.Значение;

            КонецЕсли;

        КонецЦикла;

    КонецЕсли;

    МакетКомпоновкиСКД = КомпоновщикМакета.Выполнить(схемаСКД, ИсполняемыеНастройки, РасшифровкаСКД, МакетКомпоновки, ТипГенератора);

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;

    ПроцессорКомпоновки.Инициализировать(МакетКомпоновкиСКД, ВнешниеНаборыДанных, РасшифровкаСКД);

    Если ТипЗнч(ОбъектДляЗагрузки) = Тип("ПолеТабличногоДокумента") ИЛИ ТипЗнч(ОбъектДляЗагрузки) = Тип("ТабличныйДокумент") Тогда

        ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;

        ПроцессорВывода.УстановитьДокумент(ОбъектДляЗагрузки);

    Иначе

        ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

        ПроцессорВывода.УстановитьОбъект(ОбъектДляЗагрузки);

    КонецЕсли;

    ПроцессорВывода.ОтображатьПроцентВывода = Истина;

    результат1 = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

КонецПроцедуры // ПолучитьДанныеНаОснованииСКД()

Процедура УстановитьСостояниеСтруктурыГруппировкиОтчета(СтруктураГруппировки, Включена) Экспорт
	// Устанавливает состояние для структуры с подчиненными
	// Пример вызова:
	//	УстановитьСостояниеСтруктурыГруппировкиОтчета(КомпоновщикНастроек.Настройки.Структура[0], Ложь);
	
	СтруктураГруппировки.Состояние = СостояниеЭлементаНастройкиКомпоновкиДанных[?(Включена, "Включен", "Отключен")];
	Для Каждого ПодчиненныйЭлемент Из СтруктураГруппировки.Структура Цикл
		УстановитьСостояниеСтруктурыГруппировкиОтчета(ПодчиненныйЭлемент, Включена);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьНастройкиВКомпоновщикНастроекИзМакетаСКД(КомпоновщикНастроек, МакетСКД, Форма) Экспорт
	// взято из видеоурока http://курсы-по-1с.рф/news/2016-04-28-skd-free-video/
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетСКД, Форма.УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(МакетСКД.НастройкиПоУмолчанию);
	
	
КонецПроцедуры

Процедура ДобавитьНаборДанныхВСКД_Пример(МакетСКД, ИмяНабора, МассивИменКолонок)
	
		ЗаменяемыйНаборДанных = МакетСКД.НаборыДанных.Найти(ИмяНабора);
		Если НЕ ЗаменяемыйНаборДанных = Неопределено Тогда
			МакетСКД.НаборыДанных.Удалить(ЗаменяемыйНаборДанных);
		КонецЕсли;
		
		НаборДанных = МакетСКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
		НаборДанных.Имя = ИмяНабора;
		НаборДанных.ИмяОбъекта = ИмяНабора;
		НаборДанных.ИсточникДанных = МакетСКД.ИсточникиДанных.Получить(0).Имя;
		
		Для Каждого ИмяКолонки Из МассивИменКолонок Цикл
			Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			Поле.Поле = ИмяКолонки;
			Поле.Заголовок   = ИмяКолонки;
			Поле.ПутьКДанным = ИмяКолонки;
		КонецЦикла;
	
КонецПроцедуры

// Группровая обработка ячеек

Процедура ОбъединтьЯчейкиВТабличномДокументе_Удалить(ТабличныйДокумент, МаркерОбъединения) Экспорт
	
	ОбъединяемыеЯчейки = НайтиОбластиТабличногоДокументаПоВхождениюПодстроки(ТабличныйДокумент, МаркерОбъединения);
	
	Заголовки = ОбъединяемыеЯчейки.Скопировать();
	Заголовки.Свернуть("Текст");
	Для каждого Строка из Заголовки Цикл
		
		Отбор = Новый Структура("Текст", Строка.Текст);
		ОбъединяемаяГруппа = ОбъединяемыеЯчейки.Скопировать(Отбор);
		ОбъединяемаяГруппа.Сортировать("Верх,Лево");
		
		ЛевоВерх = ОбъединяемаяГруппа[0];
		ПравоНиз = ОбъединяемаяГруппа[ОбъединяемаяГруппа.Количество()-1];
		
		Область = ТабличныйДокумент.Область(ЛевоВерх.Верх, ЛевоВерх.Лево, ПравоНиз.Верх, ПравоНиз.Лево);
		Область.Объединить();
		
	КонецЦикла;

	
КонецПроцедуры

Процедура ОбъединтьЯчейкиВТабличномДокументе(ТабличныйДокумент, МаркерОбъединения) Экспорт
	// Находит ячейки, содержащие в тексте МаркерОбъединения
	// Объединяет ячейки, располагающиеся рядом, содержащие одинаковый текст и маркер объединения 
	
	ОбъединяемыеЯчейки = НайтиОбластиТабличногоДокументаПоВхождениюПодстроки(ТабличныйДокумент, МаркерОбъединения);
	ОбъединяемыеЯчейки.Колонки.Добавить("Диапазон");
	ОбъединяемыеЯчейки.Сортировать("Верх,Лево");
	
	Для Каждого Строка из ОбъединяемыеЯчейки Цикл
		Отбор = Новый Структура("Текст,Верх,Лево", Строка.Текст, Строка.Верх-1, Строка.Лево);
		НайденныеСтроки = ОбъединяемыеЯчейки.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда
			Строка.Диапазон = НайденныеСтроки[0].Диапазон;
			Строка.Диапазон.Низ = Макс(Строка.Диапазон.Низ, Строка.Верх);
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Текст,Верх,Лево", Строка.Текст, Строка.Верх, Строка.Лево-1);
		НайденныеСтроки = ОбъединяемыеЯчейки.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда
			Строка.Диапазон = НайденныеСтроки[0].Диапазон;
			Строка.Диапазон.Право = Макс(Строка.Диапазон.Право, Строка.Лево);
			Продолжить;
		КонецЕсли;
		
		Строка.Диапазон = Новый Структура("Текст,Верх,Лево,Низ,Право", Строка.Текст, Строка.Верх, Строка.Лево, Строка.Верх, Строка.Лево);
	КонецЦикла;
	
	ОбъединяемыеЯчейки.Свернуть("Диапазон");
	Для Каждого Строка Из ОбъединяемыеЯчейки Цикл
		Диапазон = Строка.Диапазон;
		Область = ТабличныйДокумент.Область(Диапазон.Верх, Диапазон.Лево, Диапазон.Низ, Диапазон.Право);
		Область.Объединить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьТекстВТабличномДокументе(ТабличныйДокумент, ПодстрокаПоиска, ПодстрокаЗамены) Экспорт
	
	НайденныеОбласти = НайтиОбластиТабличногоДокументаПоВхождениюПодстроки(ТабличныйДокумент, ПодстрокаПоиска);
	Для каждого Строка из НайденныеОбласти Цикл
		Строка.Область.Текст = СтрЗаменить(Строка.Область.Текст, ПодстрокаПоиска, ПодстрокаЗамены);
	КонецЦикла;
	
КонецПроцедуры

Процедура СкрытьСтрокиВТабличномДокументе(ТабличныйДокумент, МаркерУдаления) Экспорт
	
	Если Ложь Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
	КонецЕсли;
	
	НайденныеОбласти = НайтиОбластиТабличногоДокументаПоВхождениюПодстроки(ТабличныйДокумент, МаркерУдаления);
	НайденныеОбласти.Свернуть("Верх");
	
	Для сч = -НайденныеОбласти.Количество() по -1 Цикл
		Строка = НайденныеОбласти[(-сч)-1];
		Область = ТабличныйДокумент.Область(Строка.Верх, , Строка.Верх, );
		Область.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиОбластиТабличногоДокументаПоВхождениюПодстроки(ТабличныйДокумент, ПодстрокаПоиска) Экспорт
	
	НайденныеОбласти = Новый ТаблицаЗначений;
	НайденныеОбласти.Колонки.Добавить("Область");
	НайденныеОбласти.Колонки.Добавить("Текст");
	НайденныеОбласти.Колонки.Добавить("Верх");
	НайденныеОбласти.Колонки.Добавить("Лево");
	
	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);
	
	Пока НЕ НайденнаяОбласть = Неопределено Цикл
		
		НоваяСтрока = НайденныеОбласти.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяОбласть);
		НоваяСтрока.Область = НайденнаяОбласть;
		
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);
		
	КонецЦикла;
	
	Возврат НайденныеОбласти;
	
КонецФункции


