
Процедура УстановитьСписокВыбораДляПараметра()
	// Данный способ работает только для встроенных отчетов
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("зн 01");
	СписокВыбора.Добавить("зн 02");
	
	Параметр = СхемаКомпоновкиДанных.Параметры.Найти("СтроковыйПараметр");
	Параметр.УстановитьДоступныеЗначения(СписокВыбора);
КонецПроцедуры

Процедура УстановитьСписокВыбораДляОтбора()
	// Данный способ работает только для встроенных отчетов

	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(2);
	СписокВыбора.Добавить(3);
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Поля.Найти("Поле1");
	Поле.УстановитьДоступныеЗначения(СписокВыбора);
	
КонецПроцедуры



УстановитьСписокВыбораДляПараметра();
УстановитьСписокВыбораДляОтбора();