
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПримерДанных");
	ТестовыеДанные = Обработки.Тестирование_ГенераторДанных.Создать().СоздатьДанныеПоТабличномуДокументу(Макет);
	
	Объект.ТабличнаяЧасть1.Загрузить(ТестовыеДанные.ПримерДанных);
	
	ОтобразитьНаСервере();
	
КонецПроцедуры



&НаСервере
Процедура ОтобразитьНаСервере()
	
	тИдентификаторыКолонок = ОтображениеДанных.ПолучитьИдентификаторыДанных(
										Объект.ТабличнаяЧасть1.Выгрузить(), 
										"Склад");
	тОтображение = ОтображениеДанных.ТрансформироватьДанныеВОтображение(
										Объект.ТабличнаяЧасть1.Выгрузить(), 
										тИдентификаторыКолонок, 
										"Товар", 
										"Количество");
	
	
	ПрограммнаяРаботаСИнтерфейсом.ОбновитьТаблицуНаФормеПоТаблицеЗначений(ЭтаФорма, "ИдентификаторыКолонок", тИдентификаторыКолонок);
	ПрограммнаяРаботаСИнтерфейсом.ОбновитьТаблицуНаФормеПоТаблицеЗначений(ЭтаФорма, "Отображение", тОтображение);
										
КонецПроцедуры

&НаКлиенте
Процедура Отобразить(Команда)
	ОтобразитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере()
	тДанные = ОтображениеДанных.ТрансформироватьОтображениеВДанные(
										Отображение.Выгрузить(), 
										ИдентификаторыКолонок.Выгрузить(), 
										"Количество");
	Объект.ТабличнаяЧасть1.Загрузить(тДанные);
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	ПрименитьНаСервере();
КонецПроцедуры


