
&НаКлиенте
Процедура Сохранить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьЗавершение", ЭтаФорма);
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("Оповещение", Оповещение);
	ВыбратьФайл(ПараметрыДиалога);
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Результат = "НЕОПРЕДЕЛЕНО";
	КонецЕсли;
	
	Для Каждого Путь Из Результат Цикл
		Сообщить(Путь);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьФайл(СтруктураПараметров = Неопределено, РежимДиалога = Неопределено) Экспорт
	// СтруктураПараметров:
	// Фильтр - Пример: "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
	//					+ "Формат TIFF (*.tif)|*.tif|"
	// ПолноеИмяФайла - начальное полное имя
	// Каталог - начальное значение каталога
	// Расширение - расширение по умолчанию
	// Заголовок
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли;
	
	Если РежимДиалога = Неопределено Тогда
		РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	
	Если СтруктураПараметров.Свойство("Каталог") = Ложь
		И СтруктураПараметров.Свойство("ПолноеИмяФайла") = Истина 
		И ЗначениеЗаполнено(СтруктураПараметров.ПолноеИмяФайла) Тогда
		Файл = Новый Файл(СтруктураПараметров.ПолноеИмяФайла);
		ДиалогВыбораФайла.Каталог = Файл.Путь;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("Заголовок") = Ложь Тогда
		Если РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
			ДиалогВыбораФайла.Заголовок = "Выберите каталог";
		Иначе
			ДиалогВыбораФайла.Заголовок = "Выберите файл";
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДиалогВыбораФайла, СтруктураПараметров);
	
	Если СтруктураПараметров.Свойство("Оповещение") Тогда
		
		ДиалогВыбораФайла.Показать(СтруктураПараметров.Оповещение);
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Возврат ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;	
	
КонецФункции