

Функция ПрочитатьDOMИзФайла(ПутьКФайлу) Экспорт
	
	ЧтениеXML=Новый ЧтениеXML(); 
	ПараметрыЧтения = Новый ПараметрыЧтенияXML(,,,ТипПроверкиXML.НетПроверки);
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу, ПараметрыЧтения);
	ПостроительDOM = Новый ПостроительDOM;
	Возврат ПостроительDOM.Прочитать(ЧтениеXML);
	
КонецФункции

Процедура ЗаписатьDOMОбъектВФайл(DOMОбъект, ПутьКФайлу)
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(ПутьКФайлу);
	ЗаписьDOM = Новый ЗаписьDOM();
	ЗаписьDOM.Записать(DOMОбъект, ЗаписьXML);
	ЗаписьXML.Закрыть();	
	
КонецПроцедуры

Процедура ОчиститьДочерниеУзлыDOMОбъекта(DOMОбъект, ИмяРодительскогоУзла)
	
	НайденныйУзел = DOMОбъект.ПолучитьЭлементыПоИмени(ИмяРодительскогоУзла)[0];
	Пока НайденныйУзел.ЕстьДочерниеУзлы() Цикл
		НайденныйУзел.УдалитьДочерний(НайденныйУзел.ПервыйДочерний);
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьУзлыПоИмениИзDOMОбъекта(DOMОбъект, ИмяУзла)
	НайденныеУзлы = DOMОбъект.ПолучитьЭлементыПоИмени(ИмяУзла);
	Для Каждого Узел Из НайденныеУзлы Цикл
		Узел.РодительскийУзел.УдалитьДочерний(Узел);
	КонецЦикла;
КонецПроцедуры

Процедура УдалитьВсеАтрибутыИзУзлаDOMОбъекта(DOMОбъект, ИмяУзла)
	НайденныеУзлы = DOMОбъект.ПолучитьЭлементыПоИмени(ИмяУзла);
	Для Каждого Узел Из НайденныеУзлы Цикл
		МассивАтрибутов = Новый Массив;
		Для Каждого Атрибут Из Узел.Атрибуты Цикл
			МассивАтрибутов.Добавить(Атрибут.Имя);
		КонецЦикла;
		
		Для Каждого ИмяАтрибута Из МассивАтрибутов Цикл
			Узел.УдалитьАтрибут(ИмяАтрибута);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
